core/api/m365/o365legacy/ws/accountsku/envelope.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing">
	<s:Header>
		<a:Action s:mustUnderstand="1">http://provisioning.microsoftonline.com/IProvisioningWebService/ListAccountSkus</a:Action>
		<a:MessageID>urn:uuid:[message_uuid]</a:MessageID>
		<a:ReplyTo>
			<a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
		</a:ReplyTo>
		<UserIdentityHeader xmlns="http://provisioning.microsoftonline.com/" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
			<BearerToken xmlns="http://schemas.datacontract.org/2004/07/Microsoft.Online.Administration.WebService">Bearer [access_token]</BearerToken>
			<LiveToken i:nil="true" xmlns="http://schemas.datacontract.org/2004/07/Microsoft.Online.Administration.WebService"/>
		</UserIdentityHeader>
		<BecContext xmlns="http://becwebservice.microsoftonline.com/" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"/>
		<ClientVersionHeader xmlns="http://provisioning.microsoftonline.com/" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
			<ClientId xmlns="http://schemas.datacontract.org/2004/07/Microsoft.Online.Administration.WebService">[clientid_uuid]</ClientId>
			<Version xmlns="http://schemas.datacontract.org/2004/07/Microsoft.Online.Administration.WebService">1.2.183.17</Version>
		</ClientVersionHeader>
		<ContractVersionHeader xmlns="http://becwebservice.microsoftonline.com/" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
			<BecVersion xmlns="http://schemas.datacontract.org/2004/07/Microsoft.Online.Administration.WebService">Version47</BecVersion>
		</ContractVersionHeader>
		<TrackingHeader xmlns="http://becwebservice.microsoftonline.com/">[tracking_uuid]</TrackingHeader>
		<a:To s:mustUnderstand="1">https://provisioningapi.microsoftonline.com/provisioningwebservice.svc</a:To>
	</s:Header>
	<s:Body>
		<ListAccountSkus xmlns="http://provisioning.microsoftonline.com/">
			<request xmlns:b="http://schemas.datacontract.org/2004/07/Microsoft.Online.Administration.WebService" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
				<b:BecVersion>Version16</b:BecVersion>
				<b:TenantId i:nil="true"/>
				<b:VerifiedDomain i:nil="true"/>
				<b:AccountId i:nil="true"/>
			</request>
		</ListAccountSkus>
	</s:Body>
</s:Envelope>